app/views/students/index.html.haml

    %tr
      %th= t('student.columns.first_name')
---
SELECT "students".* FROM "students"