app/views/teachers/show.html.haml

SELECT "teachers".* FROM "teachers"
---
    %tr
      %td= "#{t('teacher.columns.first_name')}:"