app/controllers/students_controller.rb

INSERT INTO "subject_item_notes" ("student_id", "subject_item_id", "value", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["student_id", 8], ["subject_item_id", 1], ["value", 2], ["created_at", "2016-09-29 07:30:50.421748"], ["updated_at", "2016-09-29 07:30:50.421748"]]
---
  def create_new_subject_item_note
    if subject_item_note.save

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["first_name", "test"], ["last_name", "test"], ["created_at", "2016-09-27 15:21:23.435114"], ["updated_at", "2016-09-27 15:21:23.435114"]]
---
  def create
    if student.save

UPDATE "students" SET "first_name" = $1, "updated_at" = $2 WHERE "students"."id" = $3  [["first_name", "test2"], ["updated_at", "2016-09-27 18:35:53.707778"], ["id", 1]]
---
  def update
    if student.save

DELETE FROM "students" WHERE "students"."id" = $1  [["id", 2]]
---
  def destroy
    student.destroy