app/controllers/teachers_controller.rb

INSERT INTO "teachers" ("first_name", "last_name", "academic_title", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["first_name", "y"], ["last_name", "y"], ["academic_title", "Dr."], ["created_at", "2016-09-27 21:55:44.054452"], ["updated_at", "2016-09-27 21:55:44.054452"]]
---
  def create
    if teacher.save

UPDATE "teachers" SET "academic_title" = $1, "updated_at" = $2 WHERE "teachers"."id" = $3  [["academic_title", "TA"], ["updated_at", "2016-09-28 08:43:58.956163"], ["id", 19]]
---
  def update
    if teacher.save

DELETE FROM "teachers" WHERE "teachers"."id" = $1  [["id", 2]]
---
  def destroy
    teacher.destroy